cases/OpenFOAM/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 5 0)
    (0 5 0)
    (0 0 1)
    (10 0 1)
    (10 5 1)
    (0 5 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 40 1) grading (1 1 1)
);

boundary
(
    floor
    {
        type  wall;
        faces ((0 2));
    }

    ceiling
    {
        type  wall;
        faces ((0 3));
    }

    inlet
    {
        type  patch;
        faces ((0 0));
    }

    outlet
    {
        type  patch;
        faces ((0 1));
    }

    fixedWalls
    {
        type  empty;
        faces ((0 4) (0 5));
    }
);


// ************************************************************************* //
